; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-3-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-3 - location
	p0-4 - location
	p2-0 - location
	p2-4 - location
	p5-1 - location
	p5-2 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s1)
	(at driver3 s4)
	(at truck1 s5)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at truck3 s5)
	(empty truck3)
	(at package1 s2)
	(at package2 s5)
	(at package3 s3)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 84)
	(= (time-to-walk p0-3 s0) 84)
	(= (time-to-walk s3 p0-3) 36)
	(= (time-to-walk p0-3 s3) 36)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(= (time-to-walk s0 p0-4) 97)
	(= (time-to-walk p0-4 s0) 97)
	(= (time-to-walk s4 p0-4) 44)
	(= (time-to-walk p0-4 s4) 44)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 80)
	(= (time-to-walk p2-0 s2) 80)
	(= (time-to-walk s0 p2-0) 74)
	(= (time-to-walk p2-0 s0) 74)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 28)
	(= (time-to-walk p2-4 s2) 28)
	(= (time-to-walk s4 p2-4) 8)
	(= (time-to-walk p2-4 s4) 8)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 34)
	(= (time-to-walk p5-1 s5) 34)
	(= (time-to-walk s1 p5-1) 25)
	(= (time-to-walk p5-1 s1) 25)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(= (time-to-walk s5 p5-2) 89)
	(= (time-to-walk p5-2 s5) 89)
	(= (time-to-walk s2 p5-2) 88)
	(= (time-to-walk p5-2 s2) 88)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 6)
	(= (time-to-drive s0 s1) 6)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 76)
	(= (time-to-drive s2 s1) 76)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 19)
	(= (time-to-drive s0 s2) 19)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 14)
	(= (time-to-drive s3 s2) 14)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 77)
	(= (time-to-drive s0 s3) 77)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 83)
	(= (time-to-drive s1 s3) 83)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 25)
	(= (time-to-drive s4 s3) 25)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 74)
	(= (time-to-drive s0 s4) 74)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 30)
	(= (time-to-drive s2 s4) 30)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 99)
	(= (time-to-drive s5 s4) 99)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 22)
	(= (time-to-drive s1 s5) 22)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 25)
	(= (time-to-drive s3 s5) 25)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s4)
	(at driver2 s3)
	(at driver3 s3)
	(at truck3 s2)
	(at package1 s5)
	(at package2 s1)
	(at package3 s2)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 1  (driven))) (* 2  (walked))))

)

; plan
1. (walk driver1 s2 p2-4)
   deleted: (at driver1 s2)
   added: (at driver1 p2-4)
   changed: (walked) from 0 to 28
   goals met: 0 of 7
2. (walk driver2 s1 p5-1)
   deleted: (at driver2 s1)
   added: (at driver2 p5-1)
   changed: (walked) from 28 to 53
   goals met: 0 of 7
3. (walk driver2 p5-1 s5)
   deleted: (at driver2 p5-1)
   added: (at driver2 s5)
   changed: (walked) from 53 to 87
   goals met: 0 of 7
4. (board-truck driver2 truck3 s5)
   deleted: (at driver2 s5) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 0 of 7
5. (walk driver1 p2-4 s4)
   deleted: (at driver1 p2-4)
   added: (at driver1 s4)
   changed: (walked) from 87 to 95
   goals met: 1 of 7
6. (load-truck package2 truck3 s5)
   deleted: (at package2 s5)
   added: (in package2 truck3)
   goals met: 1 of 7
7. (drive-truck truck3 s5 s3 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   changed: (driven) from 0 to 25
   goals met: 1 of 7
8. (load-truck package3 truck3 s3)
   deleted: (at package3 s3)
   added: (in package3 truck3)
   goals met: 1 of 7
9. (disembark-truck driver2 truck3 s3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s3) (empty truck3)
   goals met: 2 of 7
10. (walk driver3 s4 p0-4)
   deleted: (at driver3 s4)
   added: (at driver3 p0-4)
   changed: (walked) from 95 to 139
   goals met: 2 of 7
11. (board-truck driver2 truck3 s3)
   deleted: (at driver2 s3) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 1 of 7
12. (drive-truck truck3 s3 s2 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (driven) from 25 to 39
   goals met: 2 of 7
13. (load-truck package1 truck3 s2)
   deleted: (at package1 s2)
   added: (in package1 truck3)
   goals met: 2 of 7
14. (drive-truck truck3 s2 s1 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (driven) from 39 to 115
   goals met: 1 of 7
15. (drive-truck truck3 s1 s5 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   changed: (driven) from 115 to 137
   goals met: 1 of 7
16. (unload-truck package1 truck3 s5)
   deleted: (in package1 truck3)
   added: (at package1 s5)
   goals met: 2 of 7
17. (drive-truck truck3 s5 s4 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (driven) from 137 to 236
   goals met: 2 of 7
18. (disembark-truck driver2 truck3 s4)
   deleted: (driving driver2 truck3)
   added: (at driver2 s4) (empty truck3)
   goals met: 2 of 7
19. (walk driver3 p0-4 s0)
   deleted: (at driver3 p0-4)
   added: (at driver3 s0)
   changed: (walked) from 139 to 236
   goals met: 2 of 7
20. (walk driver3 s0 p0-3)
   deleted: (at driver3 s0)
   added: (at driver3 p0-3)
   changed: (walked) from 236 to 320
   goals met: 2 of 7
21. (walk driver3 p0-3 s3)
   deleted: (at driver3 p0-3)
   added: (at driver3 s3)
   changed: (walked) from 320 to 356
   goals met: 3 of 7
22. (board-truck driver1 truck3 s4)
   deleted: (at driver1 s4) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 2 of 7
23. (drive-truck truck3 s4 s2 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   changed: (driven) from 236 to 266
   goals met: 3 of 7
24. (unload-truck package3 truck3 s2)
   deleted: (in package3 truck3)
   added: (at package3 s2)
   goals met: 4 of 7
25. (drive-truck truck3 s2 s1 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (driven) from 266 to 342
   goals met: 3 of 7
26. (unload-truck package2 truck3 s1)
   deleted: (in package2 truck3)
   added: (at package2 s1)
   goals met: 4 of 7
27. (drive-truck truck3 s1 s2 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (driven) from 342 to 418
   goals met: 5 of 7
28. (disembark-truck driver1 truck3 s2)
   deleted: (driving driver1 truck3)
   added: (at driver1 s2) (empty truck3)
   goals met: 5 of 7
29. (walk driver1 s2 p2-4)
   deleted: (at driver1 s2)
   added: (at driver1 p2-4)
   changed: (walked) from 356 to 384
   goals met: 5 of 7
30. (walk driver1 p2-4 s4)
   deleted: (at driver1 p2-4)
   added: (at driver1 s4)
   changed: (walked) from 384 to 392
   goals met: 6 of 7
31. (walk driver2 s4 p0-4)
   deleted: (at driver2 s4)
   added: (at driver2 p0-4)
   changed: (walked) from 392 to 436
   goals met: 6 of 7
32. (walk driver2 p0-4 s0)
   deleted: (at driver2 p0-4)
   added: (at driver2 s0)
   changed: (walked) from 436 to 533
   goals met: 6 of 7
33. (walk driver2 s0 p0-3)
   deleted: (at driver2 s0)
   added: (at driver2 p0-3)
   changed: (walked) from 533 to 617
   goals met: 6 of 7
34. (walk driver2 p0-3 s3)
   deleted: (at driver2 p0-3)
   added: (at driver2 s3)
   changed: (walked) from 617 to 653
   goals met: 7 of 7
